c5/src/Documents/TenantOrder/TenantOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TenantOrder</name>
  <registerRecords>AccumulationRegister.Tenants</registerRecords>
  <attributes>
    <name>AccessPrice</name>
    <type>
      <types>DefinedType.Price</types>
    </type>
  </attributes>
  <attributes>
    <name>AgentTenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BonusPercent</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>MonthsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PromoCodeDiscount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>UsersCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Documents/TenantOrder/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var Base;
var Env;

Procedure Filling ( FillingData, StandardProcessing )
	
	Base = FillingData;
	if ( TypeOf ( Base ) = Type ( "Structure" )
		and Base.Property ( "RenewTenantOrder" ) ) then
		fillByOrderNumber ();
	endif;

EndProcedure

Procedure fillByOrderNumber ()
	
	initEnv ();
	getPreviousOrderData ();
	fillByPreviousOrder ();
	
EndProcedure

Procedure initEnv ()
	
	Env = new Structure ();
	SQL.Init ( Env );
	
EndProcedure

Procedure getPreviousOrderData ()
	
	sqlPreviousOrderData ();
	Env.Q.SetParameter ( "PreviousOrderNumber", Base.RenewTenantOrder );
	Env.Q.SetParameter ( "Tenant", SessionParameters.Tenant );
	SQL.Perform ( Env );
	if ( Env.Fields = undefined ) then
		raise Output.TenantOrderNotFound ( new Structure ( "OrderNumber", Base.RenewTenantOrder ) );
	endif; 
	
EndProcedure

Procedure sqlPreviousOrderData ()
	
	s = "
	|// @Fields
	|select dateadd ( Document.DateEnd, day, 1 ) as Date, Document.MonthsCount as MonthsCount, Document.UsersCount as UsersCount
	|from Document.TenantOrder as Document
	|where Document.Number = &PreviousOrderNumber
	|and Document.Tenant = &Tenant
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure fillByPreviousOrder ()
	
	today = BegOfDay ( CurrentSessionDate () );
	Date = Max ( today, Env.Fields.Date );
	MonthsCount = Env.Fields.MonthsCount;
	UsersCount = Env.Fields.UsersCount;
	
EndProcedure 

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not checkDate () ) then
		Cancel = true;
		return;
	endif; 
	
EndProcedure

Function checkDate ()
	
	today = BegOfDay ( CurrentSessionDate () );
	if ( Date <> Date ( 1, 1, 1 ) and Date < today ) then
		Output.LicenseDateStartError ( , "Date" );
		return false;
	endif; 
	return true;
	
EndFunction 

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	if ( Posted ) then
		if ( not canBeChanged () ) then
			Cancel = true;
			return;
		endif; 
	endif; 
	if ( DeletionMark ) then
		if ( not canBeDeleted () ) then
			Cancel = true;
			return;
		endif; 
	endif; 
	
EndProcedure

Function canBeChanged ()
	
	if ( IsInRole ( "AdministratorSystem" ) ) then
		return true;
	endif; 
	Output.TenantOrderCannotBeChanged ();
	return false;
	
EndFunction 

Function canBeDeleted ()
	
	if ( IsInRole ( "AdministratorSystem" ) ) then
		return true;
	endif; 
	if ( Documents.TenantOrder.Paid ( Ref ) ) then
		Output.TenantOrderDeletionError ();
		return false;
	endif; 
	return true;
	
EndFunction 

Procedure Posting ( Cancel, PostingMode )
	
	Env = Posting.GetParams ( Ref, RegisterRecords );
	Cancel = not Documents.TenantOrder.Post ( Env );
	
EndProcedure

#endif
